#coding=utf8

import requests,lxml,re,subprocess,pymysql
from bs4 import BeautifulSoup
from zhconv import convert
from threading import Thread
from queue import Queue

#屏蔽HTTPS认证警告
requests.packages.urllib3.disable_warnings()



class basePage(object):
    def __init__(self):
        self.dropDict={'顶点小说': 'https://www.dingdiann.net', '首页': '/', '永久书架': '/case.php', '玄幻奇幻': '/ddk_1/', '武侠仙侠': '/ddk_2/', '都市言情': '/ddk_3/', '历史军事': '/ddk_4/', '科幻灵异': '/ddk_5/', '网游竞技': '/ddk_6/', '女频频道': '/ddk_7/'}
        self.url="https://www.dingdiann.net/"
        self.ips=[]
        pass
    #获取书籍列表
    def firstDemo(self):
        print("获取书籍列表")
        url="https://www.biquge.lu"
        # session=requests.Session()
        indexPage=requests.get(url,verify=False)
        end=BeautifulSoup(indexPage.text,"lxml")
        alllink=end.find_all("a")
        newDict={}
        for line in alllink:
            name=line.get_text().strip()
            singlelink=line.attrs["href"]
            if "html" in  singlelink or len(name)<1 or name in self.dropDict.keys():
                continue
            if "biquge" in singlelink and len(singlelink)>22:
                pass
            elif "book"  in singlelink:
                singlelink = url+singlelink
            else:continue
            print(singlelink)
            print(name)
            newDict[name]=singlelink

        print(newDict)

    #获取书籍目录
    def getNovel(self):
        print("获取数据目录")
        novelDict={'开天录': '/ddk119775/', '三寸人间': '/ddk75013/', '伏天氏': '/ddk73960/', '天下第九': '/ddk32878/', '平天策': '/ddk97073/', '牧神记': '/ddk94000/', '剑来': '/ddk92482/', '万道剑尊': '/ddk65139/', '道缘浮图': '/ddk55522/', '正道潜龙': '/ddk49467/', '凡人修仙传仙界篇': '/ddk38807/', '修真聊天群': '/ddk24035/', '帝霸': '/ddk468/', '盖世帝尊': '/ddk28567/', '万古天帝': '/ddk69372/', '超级神基因': '/ddk76593/', '无敌天下': '/ddk1012/', '大主宰': '/ddk739/', '武神天下': '/ddk6043/', '至尊重生': '/ddk76897/', '极品透视': '/ddk61/', '武道大帝': '/ddk26466/', '绝代神主': '/ddk68571/', '混沌剑神': '/ddk5889/', '绝世战魂': '/ddk35673/', '凡人修仙传': '/ddk6728/', '重生西游之天篷妖尊': '/ddk75483/', '重生之魔教教主': '/ddk84490/', '九真九阳': '/ddk34980/', '大劫主': '/ddk14685/', '大数据修仙': '/ddk84997/', '真灵九变': '/ddk6731/', '最强装逼打脸系统': '/ddk72951/', '最强皇道系统之召唤诸神': '/ddk114346/', '雷霆之主': '/ddk90307/', '合租医仙': '/ddk33263/', '官途': '/ddk5390/', '一号狂兵': '/ddk125464/', '权力巅峰': '/ddk5870/', '逍遥兵王': '/ddk60975/', '异能小神农': '/ddk63762/', '绝世兵王': '/ddk69227/', '回到地球当神棍': '/ddk85801/', '疯狂神豪玩科技': '/ddk83783/', '蹭出个综艺男神': '/ddk146834/', '近身兵王': '/ddk69313/', '超级兵王': '/ddk5924/', '功夫兵王': '/ddk73183/', '黑道特种兵': '/ddk43785/', '民国谍影': '/ddk162988/', '逍遥游': '/ddk83064/', '极品家丁': '/ddk2854/', '庶子风流': '/ddk59363/', '中华武将召唤系统': '/ddk81637/', '汉祚高门': '/ddk83781/', '汉乡': '/ddk98296/', '大文豪': '/ddk95252/', '超神特种兵王': '/ddk86714/', '大唐贞观第一纨绔': '/ddk87962/', '大魏宫廷': '/ddk27952/', '二货小王爷': '/ddk136426/', '超级惊悚直播': '/ddk86113/', '神级升级系统': '/ddk77025/', '我是仙凡': '/ddk37632/', '末世：轮回重生': '/ddk81010/', '黑暗血时代': '/ddk1957/', '末世进化之王': '/ddk80341/', '绝地求生之至尊枪神': '/ddk130178/', '电影剧情穿梭戒指': '/ddk85284/', '末世召唤狂潮': '/ddk85902/', '龙骑战机': '/ddk6881/', '末日轮盘': '/ddk28403/', '极品捉鬼系统': '/ddk95430/', '荣耀王者': '/ddk120494/', '网游之最强传说': '/ddk81370/', '网游之神级土豪': '/ddk92697/', '主神崛起': '/ddk74457/', '领主之兵伐天下': '/ddk88352/', '重生之最强剑神': '/ddk21807/', '网游之诡影盗贼': '/ddk5812/', '劲爆分卫': '/ddk84481/', '王朝教父': '/ddk10945/', '网游之强化大师': '/ddk89583/', '绿茵表演家': '/ddk146831/', '网游之巅峰帝皇': '/ddk59201/', '超神机械师': '/ddk93906/', '金色绿茵': '/ddk81680/', '王国在我脚下': '/ddk144216/', '抗战之英雄血': '/ddk165875/', '大侠给跪': '/ddk159822/', '武神毁灭系统': '/ddk76979/', '校园全才保镖': '/ddk82755/', '超级护花天王': '/ddk409/', '大明星超级时代': '/ddk155402/', '英雄联盟超级变身系统': '/ddk134069/', '都市之万界帝尊': '/ddk163956/', '耐瑟瑞尔的辉煌': '/ddk110015/', '逆天狂医': '/ddk152914/', '明明可以靠脸吃饭': '/ddk164922/', '穿越之风月': '/ddk89082/', '快穿：这个女配很邪门': '/ddk105951/', '邪王独宠：纨绔异能妃': '/ddk121191/', '长生天阙': '/ddk166114/', '宋末之乱臣贼子': '/ddk66988/', '长风万里尽汉歌': '/ddk123807/', '异界大领主': '/ddk69196/', '大明最牛驸马': '/ddk166758/', '村姑召夫令': '/ddk121082/', '重生之资本巨鳄': '/ddk94224/', '惊世嫡女：医妃不好惹': '/ddk134927/', '驭鬼断魂决': '/ddk139081/', '末世之猎魂人': '/ddk135539/', '雷霆': '/ddk144331/', '拜师之极品美女': '/ddk158211/', '我的道士生涯': '/ddk24021/', '喜剧天王': '/ddk147835/', '道君': '/ddk82500/', '卧底有毒：教主太难追！': '/ddk168909/', '重生之都市狂仙': '/ddk168908/', '太古狂魔': '/ddk168907/', '太古龙尊': '/ddk168906/', '逆战神皇': '/ddk168905/', '颜之有黎': '/ddk168904/', '十里医香：携子妃嫁不可': '/ddk168903/', '这个王妃不被宠': '/ddk168902/', '诱妻入怀之编剧小萌妻': '/ddk168901/', '误闯男神世界': '/ddk168900/', '重生之逆天复仇': '/ddk168899/', '世子溺宠仵作妻': '/ddk168898/', '酷帅总裁追爱：姐姐太纯用心宠': '/ddk168897/', '庶女追夫：王爷等等我': '/ddk168896/', '娇妻来袭：霍少请接招': '/ddk168895/', '穿越成炮灰大姐大她妈': '/ddk168894/', '栽在了小可爱的手里': '/ddk168893/', '神棍的道系日常': '/ddk168892/', '将军府上有娇颜': '/ddk168891/', '香蜜沉沉之润玉传——应龙劫': '/ddk168890/', '都市之九天剑皇': '/ddk168889/', '少年小医仙': '/ddk168888/', '末世胜者为王': '/ddk168887/', '老夫少妻的互撩日常': '/ddk168886/', '花神红尘录': '/ddk168885/', '你是我的拾光': '/ddk168884/', '三国之神兽奇兵': '/ddk168883/', '斗破之马气大陆': '/ddk168882/', '天生不是好医生': '/ddk168881/', '天下谋：卿色撩人': '/ddk168880/', '自动访问顶点小说': 'https://www.dingdiann.netZ'}
        for key,link in novelDict.items():
            cutPage = requests.get(self.url+link,verify=False)
            # print(cutPage.text)
            end = BeautifulSoup(cutPage.text, "lxml")
            firststep=end.find("div",{"id":"list"})
            alllink = firststep.find_all("a")
            cutDict = {}
            for line in alllink:
                name = line.get_text().strip()
                singlelink = line.attrs["href"]
                if "html" not in singlelink or len(name) < 1 or name in self.dropDict.keys():
                    continue
                print(singlelink)
                print(name)
                cutDict[name] = singlelink
            print(cutDict)

    #获取章节正文
    def getSingle(self):
        zhengwen={'第三百章 说说你的故事': '/ddk32878/2378460.html', '第二九九章 我们远离此人': '/ddk32878/2378454.html',
         '第二九八章 死了就拉倒': '/ddk32878/2378422.html', '第二九七章 第一轮比赛结束': '/ddk32878/2378418.html',
         '第二九六章 锁定第一的天才': '/ddk32878/2378387.html', '第二九五章 真域大比': '/ddk32878/2378381.html',
         '第二九四章 升仙城（贺13盟信哥108）': '/ddk32878/2378347.html', '第二九三章 上门澄清': '/ddk32878/2378343.html',
         '第二九二章 谁杀了海王宫宗主': '/ddk32878/2378341.html', '第二九一章 小中央世界的第一天才': '/ddk32878/2378317.html',
         '第二九零章 小中央世界第一宗': '/ddk32878/2378313.html', '第二八九章 殒命上人的滴血玉牌': '/ddk32878/2378280.html',
         '第一章 仙女星': '/ddk32878/2366271.html', '第二章 哪个少年不多情': '/ddk32878/2366272.html',
         '第三章 快逃': '/ddk32878/2366276.html', '第四章 灰色的小石块': '/ddk32878/2366312.html',
         '第五章 前世之身': '/ddk32878/2366313.html', '第六章 原始山脉': '/ddk32878/2366319.html',
         '第七章 神秘的木桥': '/ddk32878/2366339.html', '第八章 忘川寺': '/ddk32878/2366342.html',
         '第九章 我是谁': '/ddk32878/2366352.html', '第十章 沈梓语': '/ddk32878/2366373.html',
         '第十一章 神秘仙女星': '/ddk32878/2366375.html', '第十二章 狄氏七刀': '/ddk32878/2366384.html',
         '第十三章 为什么要和你结婚': '/ddk32878/2366394.html', '第十四章 画一个句号': '/ddk32878/2366397.html',
         '第十五章 朋友': '/ddk32878/2366403.html', '第十六章 洛北大学武学院': '/ddk32878/2366429.html',
         '第十七章 好好活着你不愿': '/ddk32878/2366435.html', '第十八章 第一刀': '/ddk32878/2366467.html',
         '第十九章 武王之秘': '/ddk32878/2366469.html', '第二十章 帮忙': '/ddk32878/2366494.html',
         '第二十一章 大行门录': '/ddk32878/2366500.html', '第二十二章 生爷': '/ddk32878/2366520.html',
         '第二十三章 围杀': '/ddk32878/2366523.html', '第二十四章 苏莜的改变': '/ddk32878/2366539.html',
         '第二十五章 离开潭杏堂': '/ddk32878/2366564.html', '第二十六章 案发': '/ddk32878/2366568.html',
         '第二十七章 安静的新工作': '/ddk32878/2366595.html', '第二十八章 太平间烧纸': '/ddk32878/2366600.html',
         '第二十九章 五阴六阳手': '/ddk32878/2366626.html', '第三十章 引起轰动的医院': '/ddk32878/2366636.html',
         '第三十一章 狄氏制药继承人': '/ddk32878/2366664.html', '第三十二章 求到头上': '/ddk32878/2366671.html',
         '第三十三章 危险的仙女星': '/ddk32878/2366687.html', '第三十四章 假不了': '/ddk32878/2366690.html',
         '第三十五章 去抓狄九': '/ddk32878/2366710.html', '第三十六章 夜遇化缘客': '/ddk32878/2366728.html',
         '第三十七章 两个被抓的女人': '/ddk32878/2366733.html', '第三十八章 真撞到手中来了': '/ddk32878/2366768.html',
         '第三十九章 蹲守燕大': '/ddk32878/2366769.html', '第四十章 燕大武学院': '/ddk32878/2366804.html',
         '第四十一章 你可愿拜我为师': '/ddk32878/2366808.html', '第四十二章 这人好强': '/ddk32878/2366834.html',
         '第四十三章 暗杀者': '/ddk32878/2366838.html', '第四十四章 破口大骂': '/ddk32878/2366854.html',
         '第四十五章 华夏第一神医': '/ddk32878/2366859.html', '第四十六章 第一天娇曾北紫': '/ddk32878/2366865.html',
         '第四十七章 人品是什么东西': '/ddk32878/2366896.html', '第四十八章 滚的是神医': '/ddk32878/2366905.html',
         '第四十九章 真正第三刀': '/ddk32878/2366928.html', '第五十章 身有宝山不自知': '/ddk32878/2366930.html',
         '第五十一章 假不了的老巢': '/ddk32878/2366955.html', '第五十二章 假不了,我来了': '/ddk32878/2366962.html',
         '第五十三章 两刀': '/ddk32878/2366994.html', '第五十四章 给大家挂个号': '/ddk32878/2367009.html',
         '第五十五章 钱凑到了': '/ddk32878/2367029.html', '第五十六章 假不了的东西': '/ddk32878/2367041.html',
         '第五十七章 仙女星特招': '/ddk32878/2367146.html', '第五十八章 通过测试': '/ddk32878/2367147.html',
         '第五十九章 十个筹码': '/ddk32878/2367171.html', '第六十章 我是来赢钱的': '/ddk32878/2367175.html',
         '第六十一章 你作弊': '/ddk32878/2367203.html', '第六十二章 豪赌': '/ddk32878/2367373.html',
         '第六十三章 难以善了': '/ddk32878/2367438.html', '第六十四章 威胁': '/ddk32878/2367445.html',
         '第六十五章 拍卖开始': '/ddk32878/2367483.html', '第六十六章 三枚玉简': '/ddk32878/2367484.html',
         '第六十七章 价格更高的戒指': '/ddk32878/2367517.html', '第六十八章 知识是无价的': '/ddk32878/2367518.html',
         '第六十九章 拍卖会疯子': '/ddk32878/2367553.html', '第七十章 储物戒指': '/ddk32878/2367560.html',
         '第七十一章 遗言': '/ddk32878/2367584.html', '第七十二章 前往仙女星': '/ddk32878/2367591.html',
         '第七十三章 请将三枚玉简交还': '/ddk32878/2367619.html', '第七十四章 一把长菜刀': '/ddk32878/2367636.html',
         '第七十五章 精英五班': '/ddk32878/2367660.html', '第七十六章 炼化': '/ddk32878/2367678.html',
         '第七十七章 和曾东陵的交易': '/ddk32878/2367720.html', '第七十八章 危险仙女星': '/ddk32878/2367730.html',
         '第七十九章 改变试炼方式': '/ddk32878/2367754.html', '第八十章 富贵险中求': '/ddk32878/2367757.html',
         '第八十一章 把握时机': '/ddk32878/2367784.html', '第八十二章 妖兽的洞府': '/ddk32878/2367792.html',
         '第八十三章 青色小花的好处': '/ddk32878/2367827.html', '第八十四章 求救信号': '/ddk32878/2367833.html',
         '第八十五章 小树人': '/ddk32878/2367858.html', '第八十六章 狄九的刀': '/ddk32878/2367875.html',
         '第八十七章 小树人的东西': '/ddk32878/2367889.html', '第八十八章 委屈的小树人': '/ddk32878/2367902.html',
         '第八十九章 吓坏了的小树人': '/ddk32878/2367933.html', '第九十章 仙女星广场危机': '/ddk32878/2367934.html',
         '第九十一章 人如其名': '/ddk32878/2368007.html', '第九十二章 天罡宫': '/ddk32878/2368008.html',
         '第九十三章 仙女星广场的灾难': '/ddk32878/2368028.html', '第九十四章 剧变': '/ddk32878/2368029.html',
         '第九十五章 赘婿': '/ddk32878/2368045.html', '第九十六章 登仙门': '/ddk32878/2368056.html',
         '第九十七章 灵根测试': '/ddk32878/2368076.html', '第九十八章 这是什么灵根': '/ddk32878/2368086.html',
         '第九十九章 加入星河派': '/ddk32878/2368116.html', '第一百章 星河诀': '/ddk32878/2368148.html',
         '第一百零一章 沫双被打': '/ddk32878/2368149.html', '第一百零二章 打抱不平的师兄': '/ddk32878/2368183.html',
         '第一百零三章 两个小蚂蚱': '/ddk32878/2368184.html', '第一百零四章 沼海森林': '/ddk32878/2368192.html',
         '第一百零五章 菜鸟修炼': '/ddk32878/2368221.html', '第一百零六章 胆大包天': '/ddk32878/2368229.html',
         '第一百零七章 逃入沼海森林': '/ddk32878/2368263.html', '第一百零八章 戚家元魂老祖': '/ddk32878/2368281.html',
         '第一百零九章 元魂强者的怒火': '/ddk32878/2368303.html', '第一百一十章 两个天才弟子': '/ddk32878/2368311.html',
         '第一百一十一章 收获': '/ddk32878/2368333.html', '第一百一十二章 峰峦如聚，波涛如怒': '/ddk32878/2368342.html',
         '第一百一十三章 实力暴涨': '/ddk32878/2368362.html', '第一百一十四章 硬憾三级沼泽狮': '/ddk32878/2368390.html',
         '第一百一十五章 再进沼海镇': '/ddk32878/2368400.html', '第一百一十六章 战金丹': '/ddk32878/2368416.html',
         '第一百一十七章 疯狂的计划': '/ddk32878/2368430.html', '第一百一十八章 原来是你': '/ddk32878/2368452.html',
         '第一百一十九章 绝对有问题': '/ddk32878/2368468.html', '第一百二十章 驼子要的东西': '/ddk32878/2368481.html',
         '第一百二十一章 阴险的驼子': '/ddk32878/2368500.html', '第一百二十二章 回到宗门': '/ddk32878/2368513.html',
         '第一百二十三章 生机敛息': '/ddk32878/2369628.html', '第一百二十四章 屎壳郎': '/ddk32878/2369640.html',
         '第一百二十五章 组队': '/ddk32878/2369665.html', '第一百二十六章 出事': '/ddk32878/2369677.html',
         '第一百二十七章 仙人跳和天刀精金': '/ddk32878/2369703.html', '第一百二十八章 这件事还才刚开始': '/ddk32878/2369711.html',
         '第一百二十九章 真真假假': '/ddk32878/2369734.html', '第一百三十章 动手的地方': '/ddk32878/2369739.html',
         '第一百三十一章 狄九的战斗力': '/ddk32878/2369764.html', '第一百三十二章 遁术': '/ddk32878/2369775.html',
         '第一百三十三章 定时炸弹': '/ddk32878/2369796.html', '第一百三十四章 熟人': '/ddk32878/2369801.html',
         '第一百三十五章 嚣张的修士': '/ddk32878/2369833.html', '第一百三十六章 天幕开启': '/ddk32878/2369841.html',
         '第一百三十七章 可怕的存在': '/ddk32878/2369869.html', '第一百三十八章 世界书': '/ddk32878/2369881.html',
         '第一百三十九章 原来这就是紫娑沙': '/ddk32878/2369897.html', '第一百四十章 第六刀': '/ddk32878/2369908.html',
         '第一百四十一章 蓝光福天': '/ddk32878/2369930.html', '第一百四十二章 峰峦之下无生机': '/ddk32878/2369944.html',
         '第一百四十三章 蓝色池子': '/ddk32878/2369964.html', '第一百四十四章 轰破绞杀阵': '/ddk32878/2369972.html',
         '第一百四十五章 以一战五': '/ddk32878/2370000.html', '第一百四十六章 红眼': '/ddk32878/2370005.html',
         '第一百四十七章 他不行了': '/ddk32878/2370040.html', '第一百四十八章 逃吧': '/ddk32878/2370052.html',
         '第一百四十九章 一个叫狄九的修士': '/ddk32878/2370080.html', '第一百五十章 跗骨': '/ddk32878/2370092.html',
         '第一百五十一章 山顶的青色火焰（上架第一更，请求月票支持）': '/ddk32878/2370117.html', '第一百五十二章 就这样走了吗': '/ddk32878/2370118.html',
         '上架了，激动中，说几句': '/ddk32878/2370119.html', '第一百五十三章 上古宗门': '/ddk32878/2370133.html',
         '第一百五十四章 无心插柳（第四更求月票）': '/ddk32878/2370139.html', '第一百五十五章 七级': '/ddk32878/2370159.html',
         '第一百五十六章 天刀宗': '/ddk32878/2370165.html', '第一百五十七章 戚家强者回归': '/ddk32878/2370169.html',
         '第一百五十八章 道火': '/ddk32878/2370181.html', '第一百五十九章 光明星空': '/ddk32878/2370202.html',
         '第一百六十章 恶魂池': '/ddk32878/2370210.html', '第一百六十一章 落进恶魂池': '/ddk32878/2370378.html',
         '第一百六十二章 青芒乍现': '/ddk32878/2370379.html', '第一百六十三章 狄九品行有问题': '/ddk32878/2370393.html',
         '第一百六十四章 大坤诀总纲': '/ddk32878/2370403.html', '第一百六十五章 极夜天墟底的人（贺第八盟爱爱家的小可爱）': '/ddk32878/2370412.html',
         '第一百六十六章 可怜的人': '/ddk32878/2370428.html', '第一百六十七章 天幕关闭': '/ddk32878/2370431.html',
         '第一百六十八章 消失的世界书（贺第九盟一楼）': '/ddk32878/2370440.html', '第一百六十九章 五级道火': '/ddk32878/2370459.html',
         '第一百七十章 天娑': '/ddk32878/2370464.html', '第一百七十一章 真正的刀意': '/ddk32878/2370489.html',
         '第一百七十二章 五大陆': '/ddk32878/2370495.html', '第一百七十三章 修复舍夜大陆': '/ddk32878/2370527.html',
         '第一百七十四章 杀向戚家商楼': '/ddk32878/2370531.html', '第一百七十五章 不留情': '/ddk32878/2370552.html',
         '第一百七十五章 戚家商楼的末日': '/ddk32878/2370562.html', '第一百七十七章 狄前辈(贺第十盟万年青）': '/ddk32878/2370570.html',
         '第一百八十八章 暗星废墟': '/ddk32878/2370603.html', '第一百七十九章 大脚印': '/ddk32878/2370612.html',
         '第一百八十章 道榜（贺第十一盟高Big松）': '/ddk32878/2370619.html', '第一百八十一章 海榜强者之战': '/ddk32878/2370641.html',
         '第一百八十二章 不如行万里路': '/ddk32878/2370661.html', '第一百八十三章 五陆道会': '/ddk32878/2370693.html',
         '第一百八十四章 我有世界书的消息': '/ddk32878/2370701.html', '第一百八十五章 炙神草是什么东西': '/ddk32878/2370730.html',
         '第一百八十六章 天机岛': '/ddk32878/2370738.html', '第一百八十七章 必须要到手': '/ddk32878/2370767.html',
         '第一百八十八章 拜夜湖水的可怕': '/ddk32878/2370772.html', '第一百八十九章 到底是谁找死': '/ddk32878/2370809.html',
         '第一百九十章 红缨少爷的劝告': '/ddk32878/2370812.html', '第一百九十一章 五陆道塔的秘密': '/ddk32878/2370847.html',
         '第一百九十二章 出名了': '/ddk32878/2370850.html', '第一百九十三章 大方的虎一畔': '/ddk32878/2370880.html',
         '第一百九十四章 剑心': '/ddk32878/2370887.html', '第一百九十五章 五陆道盘': '/ddk32878/2370913.html',
         '第一百九十六章 大家懵了': '/ddk32878/2370924.html', '第一百九十七章 你会不会死掉': '/ddk32878/2370951.html',
         '第一百九十八章 九十层的秘密': '/ddk32878/2370957.html', '第一百九十九章 姬红川的实力': '/ddk32878/2370980.html',
         '第二百章 直面五大宗主': '/ddk32878/2370984.html', '第二百零一章 伪君子': '/ddk32878/2371014.html',
         '第二零二章 大收获': '/ddk32878/2371019.html', '第二零三章 寒青依': '/ddk32878/2371040.html',
         '第二零四章 感悟世界书': '/ddk32878/2371046.html', '第二零五章 你的小命很危险': '/ddk32878/2371081.html',
         '第二零六章 飞升仙界的通道': '/ddk32878/2371089.html', '第二零七章 再见裂界符': '/ddk32878/2371112.html',
         '第二零八章 竞拍裂界符': '/ddk32878/2371150.html', '第二零九章 等人欺负': '/ddk32878/2371151.html',
         '第二百一十章 输了戒指': '/ddk32878/2371157.html', '第二一一章 高不见顶的雪山': '/ddk32878/2371189.html',
         '第二一二章 你有狄九的消息？': '/ddk32878/2371194.html', '第二一三章 惊人的地方': '/ddk32878/2371216.html',
         '第二一四章 借你识海一用': '/ddk32878/2371223.html', '第二一五章 离地焰光旗': '/ddk32878/2371266.html',
         '第二一六章 七级刀阵': '/ddk32878/2371273.html', '第二一七章 刀阵成': '/ddk32878/2371297.html',
         '第二一八章 十级识海之艰难': '/ddk32878/2371303.html', '第二百一十九章 质变': '/ddk32878/2371331.html',
         '第二二零章 遭遇在拜夜湖': '/ddk32878/2371343.html', '第二二一章 屈辱': '/ddk32878/2371360.html',
         '九月求一下月票吧': '/ddk32878/2371361.html', '第二二三章 再遇寒青依': '/ddk32878/2371374.html',
         '第二二四章 红缨少爷又挑战了': '/ddk32878/2371383.html', '第二二五章 往事如烟': '/ddk32878/2371413.html',
         '第二二六章 当年事因': '/ddk32878/2371422.html', '第二二七章 灭': '/ddk32878/2371451.html',
         '第二二七章 出大事了': '/ddk32878/2371457.html', '第二二八章 本少狄九': '/ddk32878/2371487.html',
         '第二二九章 星恒公会会主求助': '/ddk32878/2371493.html', '第二三零章 暨城的狄远军': '/ddk32878/2371513.html',
         '第二三一章 强者说话的世界': '/ddk32878/2371516.html', '第二三二章 叔昊澜是你干掉的吧': '/ddk32878/2374534.html',
         '第二三三章 名额': '/ddk32878/2374541.html', '第二三四章 横渡虚空': '/ddk32878/2374574.html',
         '第二三五章 时间易逝人易变': '/ddk32878/2374587.html', '第二三六章 恩怨了了': '/ddk32878/2374615.html',
         '第二三七章 黑色轮回': '/ddk32878/2374622.html', '第二三八章 我给你留一个孩子': '/ddk32878/2374675.html',
         '第二三九章 漠江禁地': '/ddk32878/2374688.html', '第二四零 这里我有些熟悉': '/ddk32878/2374730.html',
         '第二四一章 是我害了你': '/ddk32878/2374734.html', '第二四二章 你做我的伴修': '/ddk32878/2374761.html',
         '第二四三章 陨丹山': '/ddk32878/2374767.html', '第二四四章 木丹炉': '/ddk32878/2374791.html',
         '第二四五章 天机岛有变': '/ddk32878/2374796.html', '第二四十六章 建鼎的惊人来历': '/ddk32878/2374826.html',
         '第二四七章 丹道有雏形': '/ddk32878/2376419.html', '第二四八章 带回我昆门再说': '/ddk32878/2376448.html',
         '第二四九章 问到你崩溃': '/ddk32878/2376453.html', '第二五零章 真灵世界现': '/ddk32878/2376498.html',
         '第二五一章 畜生': '/ddk32878/2376567.html', '第二五二章 狄飞雪的秘密': '/ddk32878/2376606.html',
         '第二五三章 见面': '/ddk32878/2376618.html', '第二五四章 小世界星开启': '/ddk32878/2376647.html',
         '第二五五章 那是为什么啊': '/ddk32878/2376667.html', '第二五六章 天然隐阵下的东西': '/ddk32878/2376696.html',
         '第二五七章 种修山': '/ddk32878/2376701.html', '第二五八章 可怕的剑意（贺12盟主陈祖丞）': '/ddk32878/2376704.html',
         '本月第二次单章': '/ddk32878/2376707.html', '第二五九章 傻了的红缨少爷': '/ddk32878/2376732.html',
         '第二六零章 第一百零九刀': '/ddk32878/2376738.html', '第二六一章 岁月如刀啊': '/ddk32878/2376761.html',
         '第二六二章 冲向种修山': '/ddk32878/2376767.html', '第二六三章 一死一活': '/ddk32878/2377827.html',
         '第二六四章 和寒青依的交易': '/ddk32878/2377843.html', '第二六五章 被怀疑': '/ddk32878/2377888.html',
         '第二六六章 药王脉': '/ddk32878/2377894.html', '第二六七章 惹大麻烦了': '/ddk32878/2377917.html',
         '第二六八章 太古雷纹': '/ddk32878/2377923.html', '第二六九章 疯狂冲击化真': '/ddk32878/2377956.html',
         '第二七零章 小世界星关闭': '/ddk32878/2377961.html', '第二七一章 破门而入': '/ddk32878/2377994.html',
         '第二七二章 碾压': '/ddk32878/2378004.html', '第二七三章 鼎鼎大名': '/ddk32878/2378028.html',
         '第二七四章 到底要得罪多少大宗': '/ddk32878/2378033.html', '第二七五章 抓耿戟': '/ddk32878/2378058.html',
         '第二七六章 找上门的虚剑宗': '/ddk32878/2378065.html', '第二七七章 化真五层的少年': '/ddk32878/2378096.html',
         '第二七八章 暗算虚剑宗': '/ddk32878/2378101.html', '第二七九章 光临天机岛': '/ddk32878/2378127.html',
         '第二八零章 硬憾二阁主': '/ddk32878/2378133.html', '第二八一章 我没啥打斗经验': '/ddk32878/2378171.html',
         '第二八二章 宇宙胎膜': '/ddk32878/2378183.html', '第二八三章 五陆印': '/ddk32878/2378194.html',
         '虽然有点郁闷': '/ddk32878/2378195.html', '第二八四章 星河危机': '/ddk32878/2378213.html',
         '第二八五章 星河宗护阵': '/ddk32878/2378219.html', '第二八六章 又是两脚': '/ddk32878/2378244.html',
         '第二八七章 墨雨媗': '/ddk32878/2378251.html', '第二八八章危险的地方': '/ddk32878/2378276.html',
         '求一下月票吧': '/ddk32878/2378348.html'}

        for key,link in zhengwen.items():
            cutPage = requests.get(self.url+link,verify=False)
            # print(cutPage.text)
            end = BeautifulSoup(cutPage.text, "lxml")
            [s.extract() for s in end("script")]
            firststep=end.find("div",{"id":"content"})
            # firststep.attrs["script"]=""
            # print(firststep.script)
            cutDict = {}
            # name = firststep.get_text()
            # name = name.strip()
            #stripped_strings
            new=""
            for s in firststep.stripped_strings:
                new+="\n\t"+s
            print(new)
            # print(key)
            # print(name)
            # cutDict[key]=name
            # print(cutDict)

    #保存为txt
    def writeText(self,name,body):
        with open("./save/{}.txt".format(name), "w+", encoding="utf8") as f:
            f.write(body)

    #存到数据库
    def saveToSql(self):
        pass

    #转换繁简
    def change(self,textIn):
        text_Out = convert(textIn,"zh-cn")
        """
        zh-cn 大陆简体
        zh-tw 台灣正體
        zh-hk 香港繁體
        zh-sg 马新简体（无词汇表，需要手工指定）
        zh-hans 简体
        zh-hant 繁體
        """
        print(text_Out)
        return text_Out

    # 通过ping验证ip是否有效
    def check_ip(self,i,ip_code):
        while True :
            #获取队列中一个待测试ip
            proxies_pri=ip_code.get()
            print(i,proxies_pri)
            if ":" in proxies_pri:
                ip=proxies_pri.split(":")[0]
            print("Thread {} pinging {}".format(i, ip))
            cmd_input = subprocess.Popen(["ping.exe", ip], stdin=subprocess.PIPE, stdout=subprocess.PIPE,
                                         stderr=subprocess.PIPE, shell=True)
            cmd_out = cmd_input.stdout.read()
            regex = re.compile("\d+%", re.IGNORECASE)
            # print(cmd_out.decode("gbk"))
            # print(cmd_out)
            print("Thread {} end.".format(i, ip))
            if regex.findall(cmd_out.decode("gbk")) == ["0%"] and b"ms" in cmd_out :
                self.ips.append(proxies_pri)
            else: print(cmd_out.decode("gbk"))
            #队列为空时，结束线程
            if ip_code.empty:
                ip_code.task_done()
            return

    #通过队列进行遍历，
    def threadFunc(self,ipsList=[]):
        ips = ['127.0.0.1', '10.1.51.103']
        num_threads = 3
        q = Queue()
        # start num_threads threads
        for i in range(num_threads):
            t = Thread(target=self.check_ip, args=(i,q))  # 批量创建线程
            t.setDaemon(True)  # 设置为守护线程  主线程A中，创建了子线程B，将A设置为守护线程，此时主线程A执行结束啦，不管子线程B是否执行完成，一并和A一起退出
            t.start()

        for i in ipsList:
            q.put(i)

        print("main thread waiting ...")
        q.join()  # 主线程A中，创建了子线程B，并在主线程中设置B.join(),那么，主线程A会在调用的地方等待，直到子线程B完成操作后，才可以继续向下执行。
        print(self.ips)
        print("Done")

    def mock(self):
        ipsList=['183.4.65.195:4216', '183.162.170.91:4216', '119.133.16.232:4216', '223.241.6.59:4216', '223.241.2.24:4216', '101.132.159.98:8080', '182.138.160.193:8118', '106.14.76.134:8080', '58.220.95.42:10174', '58.220.95.30:10174', '58.220.95.34:10174', '58.220.95.40:10174', '183.157.175.67:8118', '180.125.238.219:4216', '117.87.209.227:4216', '114.105.183.73:4216', '119.41.198.44:53281', '117.71.169.90:3000', '117.71.164.182:3000', '223.99.197.253:63000', '223.241.7.181:3000', '113.208.115.190:8118', '114.99.253.194:8118', '125.73.220.18:31036', '117.87.209.16:4216', '112.247.175.135:8060', '120.194.42.157:38185', '121.17.210.114:8060', '58.254.220.116:52470', '117.87.208.10:4216', '114.98.26.84:4216', '180.123.169.40:4216', '106.110.96.70:4216', '121.233.86.231:4216', '116.22.30.121:4216', '101.200.127.149:3129', '36.6.224.102:3000', '118.180.166.195:8060', '114.98.24.67:4216', '58.220.95.32:10174', '117.71.172.97:3000', '117.71.169.150:3000', '211.152.33.24:48749', '182.138.178.238:8118', '218.75.69.50:39590', '123.115.134.79:8118', '117.71.164.150:3000', '121.8.146.99:8060', '60.217.64.237:31923', '124.90.49.146:8888', '36.6.224.40:3000', '120.79.20.63:8888', '221.2.175.238:8060', '123.168.66.202:8118', '49.81.26.139:4216', '59.63.112.117:42354', '112.239.254.105:8118', '61.54.225.130:8060', '36.59.111.218:4216', '61.178.149.237:59042', '113.12.202.50:40498', '183.157.175.210:8118', '113.103.233.150:4216', '183.162.146.33:4216', '218.14.108.53:8060', '39.156.51.7:8080', '110.249.176.26:8060', '120.198.76.45:41443', '223.241.6.184:4216', '221.226.163.26:4216', '119.133.196.116:4216', '183.162.171.154:4216', '119.254.94.93:46323', '180.104.215.179:4216', '119.254.94.114:45691', '180.123.219.65:4216', '114.101.252.142:3000', '36.6.225.133:3000', '223.247.95.188:3000', '114.98.25.139:4216', '61.145.49.139:4216', '180.123.204.209:4216', '115.46.80.107:8123', '111.72.25.135:10086', '114.99.114.229:3000', '180.123.169.243:4216', '114.222.247.239:4216', '180.123.169.164:4216', '36.59.117.168:4216', '180.111.139.109:4216', '113.103.233.157:4216', '221.2.155.35:8060', '111.222.141.127:8118', '223.247.92.157:4216', '218.76.253.201:61408', '121.233.87.196:4216', '121.225.53.49:4216', '61.145.48.208:4216', '113.128.148.50:8118', '114.98.24.180:4216']
        self.threadFunc(ipsList)

    def mainFunc(self):
        #按照格式，层层记录书籍信息（书名、地址、类型、作者、连载/完结)
        #获取有效iplist
        #获取通过获取使用ip代理去获取书籍，一个ip对应一本书（成功则在书籍后进行标记，失败则不修改标记）
        pass


if __name__=="__main__":
    myprocess=basePage()
    # myprocess.change("以上為繁體文本")
    myprocess.firstDemo()
    # ipList=myprocess.deal_page()
    # print(ipList)
    # myprocess.check_ip("175.148.78.174")
    # z= myprocess.threadFunc(ipList)
    # myprocess.mock()
    # print(myprocess.ips)